{
  "main": {
    "name":"Noor Abdikadir",
    "description":"I am a web developer and I use front & back end technologies to develop a memorable experience on the web. Keep looking around! :)",
    "image":"profilepic.jpg",
    "bio":" I am very family and relationship oritented individual. I believe relationsips and the experiences we have with individuals in this life is what makes life worth living, interesting, and worth learning more about.",
    "bio_two":"I love an adventorous life.\n I often find myself doing unexpected random things that spice up my journey. From buying my first house at 21, driving to Utah in a 200K mile 2008 van, and so much more! This year I went sky diving.",
    "contactmessage":"You can directly reach me via email or phone number. Or through the social links down below",
    "email": "nooromar305@gmail.com",
    "phone": "520-342-4458",
    "github":"https://github.com/NoorA1125",
    "project":"#portfolio",
    "address":{
      "city":"Tucson",
      "state":"AZ",
      "zip": "85716"
    },
    "website": "#",
    "resumedownload":"../../images/nAbdikadir_Resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/noora1125/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/simply_nurr/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/NoorA1125",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Technologies i've worked with",
    "education":[
      {
        "school":"University of Arizona Boot Camp",
        "degree":"Full Stack Developer",
        "graduated":"02/2021 - present",
        "description":"U of A's 3 month intensive full stack bootcamp will forever be a memorable experience. The BootCamp equipped me with the latest and greatest trending techlogies to date. From the start, it was fast pace into HTML/JS/CSS then we dove even deeper into ExpressJS for our servers, NodeJS, MongoDb for our databases, and ReactJS. The best part about this was the indepence & group projects. Seeing others struggle with me took some weight off me and taught me that it's normal and part of the process. I can look back now and see that as fast as it was, and I know I have a lot more to learn, but I left knowing more then I started with. I feel more confident & competent in my skills."
      }
    ],
   
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.png"
      },
      {
        "name": "BootStrap",
        "description": "Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image": "bootstrap.png"
      },
      {
        "name": "ExpressJS",
        "description": "I enjoy ExpressJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image": "express.png"
      },

      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "node.png"
      },
      {
        "name": "Bulma",
        "description": "I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image": "bulma.png"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.png"
      },
      {
        "name": "Heroku",
        "description": "I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image": "heroku.png"
      },
      {
        "name": "React Js",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image": "react.png"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"What To Watch",
        "category":"My Travel Blog for my post-university travels",
        "image":"08.png",
        "url":"https://what-to-watch-hana.herokuapp.com/",
        "github": "https://github.com/NoorA1125/whatToWatch"
      },
      {
        "title":"Meals & Tails",
        "category":"My Travel Blog for my post-university travels",
        "image":"06.jpg",
        "url":"https://mcolumbusua21.github.io/Project1/",
        "github": "https://github.com/mcolumbusua21/Project1"
      },
      {
        "title":"Offline Budget App",
        "category":"A React based resume website template",
        "image":"07.png",
        "url":"https://evening-dawn-37876.herokuapp.com/",
        "github": "https://github.com/NoorA1125/budget"
      },
      {
        "title":"Weather App",
        "category":"A React based resume website template",
        "image":"04.jpg",
        "url":"https://noora1125.github.io/WeatherApp/",
        "github": "https://github.com/NoorA1125/WeatherApp"
      },
      {
        "title":"Password Generator",
        "category":"Playing around with some Javascript. Weekly challenge",
        "image":"03.jpg",
        "url":"https://noora1125.github.io/password/",
        "github": "https://github.com/NoorA1125/password"
      },
      {
        "title":"Work Day Planner",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"05.jpg",
        "url":"https://noora1125.github.io/day-planer/",
        "github": "https://github.com/NoorA1125/day-planer"
      },
      {
        "title":"Kevin Samuels",
        "category":"This was a re-design of his current website",
        "image":"01.jpg",
        "url":"https://noora1125.github.io/ks/",
        "github": "https://github.com/NoorA1125/ks"
      },
      {
        "title":"Portfolio",
        "category":"A portfolio I did from scratch to design to development",
        "image":"02.jpg",
        "url":"https://noora1125.github.io/Portflio/",
        "github": "https://github.com/NoorA1125/Portflio"
      }
    ]
  }
}
